{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid1",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "61",
          "150"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          -0.464507862802448,
          1.9247766382543354,
          1.4283063606648816,
          1.671315778727417,
          2.8791836517041913,
          -3.2377769407872106,
          3.2583177691589422,
          5.2284001835124965,
          -0.027268089074146403,
          0.16461090223184963,
          0.9809620737774156,
          5.382600599444622,
          3.82521156440797,
          -1.2108779691433917,
          -2.0896593095153704,
          0.4004388940601857,
          -1.813361481407802,
          -0.05316755485952836,
          4.460592926124868,
          3.41922558736635,
          1.4692924828293499,
          0.6975502728249461,
          1.9209489515549953,
          -1.4691907965261155,
          -2.337412721518587,
          -1.2942538349977981,
          -0.7375485163292935,
          -1.858412438451706,
          -1.088059005293695,
          2.1932405365144305,
          -0.055964935430439885,
          1.6807776937039949,
          5.457598620450076,
          -2.803376620090895,
          -0.44658923077418655,
          2.2515524497803954,
          -1.8808933555411567,
          -1.0549079998495983,
          1.7196057068438284,
          4.196626975914553,
          -1.6352253622517667,
          -0.39016044921756876,
          0.7823321116595855,
          -0.9360140121477847,
          0.7035390013874105,
          -2.4382445821027483,
          0.261391695223606,
          -0.9375571089368739,
          -0.6727911828644206,
          -0.8637649810649868,
          -1.160423234095936,
          0.28749512907719404,
          0.6768477171252273,
          8.598660413523369,
          0.9935947344184133,
          0.1014780808040316,
          1.4061808057046803,
          -1.004082959203213,
          0.9530511757016702,
          -4.75401771484969,
          2.334342543846518,
          -0.25315004347979175,
          0.43589542616718924,
          0.08599716186175221,
          0.876820173196792,
          3.9410864349434522,
          -1.3072420208256361,
          0.8629786804841761,
          2.3896896754608377,
          0.06918073249969264,
          4.100392921462532,
          0.5286573579088035,
          1.1031176302468415,
          -0.25035411635944865,
          0.5046543872299926,
          -3.704985594135038,
          1.2986009504424987,
          0.5468449416798452,
          1.612311589189131,
          2.2572716927992147,
          0.23919667793719088,
          4.813490165921073,
          1.4186448483566132,
          -0.025364402695981194,
          -0.4618323759861809,
          -0.4288365726167202,
          -1.3707729609037673,
          0.8325447420681398,
          0.8405409155675406,
          1.5986756323889004,
          1.7764624895965335,
          0.9926402272096598,
          -1.784647018085556,
          -0.26481894417308466,
          1.4548795253334648,
          0.1584771302455539,
          -1.1053680028557749,
          -2.007652773838851,
          1.2073549509667243,
          -0.10237723518931717,
          0.30123346235342047,
          -1.2664991687238492,
          -2.189324478203624,
          1.9302492904165853,
          -1.4663576214439569,
          -4.322869557387321,
          4.257266852999774,
          -2.792218560539926,
          1.668928749770257,
          1.117588172081795,
          -0.5056898920033072,
          -0.502309793616239,
          1.872344941003478,
          -0.7334098986577953,
          0.13721075863448737,
          -3.7209636604451886,
          -0.22939116942791146,
          3.417372830133335,
          1.1949774962825725,
          -1.1624903840296346,
          -0.7588726661619739,
          -4.123238993027267,
          3.1626912340057705,
          -0.4329542184918038,
          1.3199481659449817,
          -3.0668169293960825,
          1.1214507516894159,
          -0.08174968335935447,
          0.4570924727791201,
          0.7526570036267097,
          -1.003335246728396,
          0.4948403231236769,
          1.120677704174878,
          0.6195119422761336,
          0.5188210694174712,
          0.5860199650105792,
          -0.6345075502035068,
          -1.7311516164295406,
          -1.0002005502364615,
          0.7727695593881294,
          7.088239144545455,
          1.9034754742061684,
          -4.548654092955293,
          2.4526284258907647,
          1.1462074487387133,
          0.5557049462235812,
          -1.5585851462169482,
          -1.2756773652548206,
          -0.6603298591968816,
          2.11095812766935,
          -2.393086770816513,
          -2.8935808789948574,
          1.765224973360502,
          -0.6007797948355691,
          -1.247360586431032,
          1.8320535321958311,
          -1.6119167588098153,
          -1.6108373246854182,
          -0.1328709748953977,
          -0.4761229564658267,
          -0.48158600660171186,
          -1.288529149380328,
          0.5820178599089589,
          1.733588526122811,
          1.4027916966539848,
          -0.3554053853471427,
          -1.323215013945604,
          -2.60765350239273,
          0.26703362445420276,
          -3.163686227238059,
          0.5505793771722274,
          0.23492073208688014,
          -2.3340556741951346,
          1.8941355810877627,
          2.550636320511123,
          2.141581741671251,
          -0.2201739372154623,
          2.9095182973283316,
          3.0981780715089893,
          -0.7812214194320592,
          1.1908261172361327,
          -1.152520260684355,
          -1.2853441582531957,
          1.4397019347110727,
          -0.13737093000299821,
          -2.1567454842644747,
          2.346072971911106,
          0.7929267565877638,
          -0.9068138347541661,
          -1.6424610519100213,
          -0.5779268209047489,
          -0.046643307563090035,
          -2.108023878171255,
          0.42597048278455985,
          -0.28494828782858517,
          1.9184100090457084,
          -2.7012748671227715,
          1.0764486315695883,
          1.9295710469356413,
          0.6447203337522487,
          -0.15324237562600276,
          0.41310836354288016,
          -3.182032988859071,
          -1.975751003087569,
          2.359151452661724,
          2.0487422953585335,
          2.0123244027339866,
          1.111846494815949,
          -1.223242238889242,
          2.412079652689954,
          -1.8719835255147652,
          -0.966910929867753,
          2.0620660783625944,
          0.06645626583285277,
          0.18748256596273857,
          1.545841650345006,
          1.988615885916679,
          -0.5811947008676058,
          1.1726664300272347,
          0.7874571510922077,
          -1.0875754290079471,
          0.9234942668124588,
          -0.8176316335829894,
          0.24925042427471125,
          0.3047341065513934,
          1.9722449886317341,
          -0.517912034640463,
          -1.3328071777976334,
          -0.5235450304105341,
          -0.6807593863563296,
          0.5378023198489489,
          -1.3856733607429392,
          -0.6343597816066122,
          -0.3593255215833435,
          -2.396528867437034,
          -0.8975393723288363,
          1.6232391313911265,
          -2.1325502600242223,
          -1.2689320624045117,
          -2.0269516031409474,
          -0.0526299729750997,
          0.529154152634041,
          1.2137877516988411,
          0.4005019998080162,
          -0.5113156621325274,
          -0.8810758988653092,
          -0.7068943818635006,
          2.9867480445222,
          1.2899424716689816,
          0.7030804829962974,
          -0.06384288350048686,
          -0.12159877551805995,
          1.631104924853415,
          -1.2848017858531016,
          2.236888028313615,
          0.8673121527748792,
          -2.1811381003806143,
          1.3737548255418799,
          0.1993804281123917,
          -1.06989566760813,
          -0.7194248466012699,
          -0.11352673032987909,
          -2.1601285957446503,
          0.6732296542283569,
          0.7155311113791916,
          1.3247663824895006,
          1.1442155908441716,
          -1.4940370862159047,
          -1.3165638082915831,
          1.5598389689128809,
          -0.03378958871702139,
          1.9796049577366388,
          -0.9946143989496836,
          0.019372185224732576,
          -0.29428509962848187,
          1.5107569945708372,
          -0.7288065437019131,
          0.633971401151056,
          0.5592741153234551,
          1.9244229640446815,
          2.5915102378947434,
          1.0733069480729087,
          1.995742579745652,
          -1.9250358877865468,
          -0.36486893306321094,
          2.2134050408746018,
          -0.879571744976043,
          1.7417248948911221,
          0.8090395449367623,
          -1.1353586357859706,
          -2.4649769721425288,
          0.5580114856074158,
          1.65120492899406,
          -3.960430390000535,
          -0.6456852136728819,
          -1.4616801565555493,
          1.806372129887064,
          1.9510868640548602,
          -2.3571837470365264,
          0.4771731998747107,
          3.0732725249439747,
          2.0521627339212385,
          -3.054636135445175,
          -0.3170312967801846,
          -0.8784319300161452,
          -0.8245656505650275,
          -0.3313039994788376,
          -1.1131464223144854,
          0.34520034511005315,
          0.052647544098365515,
          0.1297143703333823,
          -1.7284748648697177,
          -2.3806194623993155,
          -0.730753933789141,
          -0.5877297987098303,
          -0.030494941881322127,
          2.388452206440132,
          3.3130434388157255,
          -2.914906512121269,
          1.310678655670371,
          -2.382785965730816,
          -0.5788898350544379,
          0.739582392679134,
          -1.4603385552780868,
          -1.3356689502540846,
          -1.520564482481297,
          1.0672500965875706,
          -1.6148211633818212,
          -2.8228418641452664,
          -0.8624265332048887,
          -1.4618153604959445,
          0.6954030016897339,
          -1.0207614389020565,
          -0.12920042900420797,
          0.437402448348399,
          0.843757612132392,
          -1.05393408831061,
          0.02122007698416988,
          0.14261902372552404,
          -0.45840691899643954,
          2.1081895963305004,
          0.3368473627054821,
          1.54945107275971,
          0.008933425630523212,
          0.01813473512138923,
          -0.24117610269677364,
          2.708629589983852,
          -0.3694207369332895,
          -1.719137167599583,
          -0.3759599964347875,
          1.6533751466270525,
          -0.3533229119850424,
          2.5501575877914995,
          -1.9640371055247963,
          -3.2104853459089258,
          -3.2440363183220304,
          -3.9365064255084423,
          -0.5033713766055886,
          0.9822333164394044,
          -0.5649745672280396,
          0.39284691119859483,
          0.8337344989475279,
          -2.7185007880789342,
          -0.08146096843625138,
          -1.5234897206634566,
          -3.5883311635098454,
          -0.81953959256181,
          -0.29653968524704344,
          -3.0627922540777446,
          -1.1730800750338124,
          -0.7395560032560105,
          -1.544647633256385,
          0.5628940643288712,
          0.044432161484504226,
          -0.6181622658877889,
          -0.3806214792319052,
          -0.13490330035272566,
          0.7966397364491364,
          -0.3595843062408226,
          -1.3159275731635847,
          -0.27943993161781266,
          -1.7124730064889981,
          -0.3197213580208913,
          0.22963795704037301,
          2.565239259094529,
          1.4408083684232322,
          -1.3534476258077464,
          1.2124560239523405,
          0.5651484947113193,
          1.0864111188373413,
          -1.5917435659750807,
          -1.349603042724998,
          -0.3855401165846422,
          -0.6041256453750858,
          -0.10033769003401148,
          0.985502788250763,
          1.7993602231780474,
          -2.3291975220303534,
          -2.641987084523546,
          -1.2440639620867082,
          -0.5187350319323183,
          1.7790946297065438,
          -0.129088458970802,
          0.3896160138721108,
          -0.9910490344996749,
          1.3697776136724555,
          -0.1048712011616972,
          0.8470786018668928,
          -1.3997006650525423,
          0.2661859522603462,
          0.5439204412726277,
          0.36885992806040085,
          1.023043370397616,
          -0.5039135392691939,
          -1.0842568420603993,
          1.0256959478907475,
          -0.9993949580812185,
          -0.6280716983947163,
          0.5125911249486048,
          -1.399204443651046,
          1.306617477130789,
          -0.19559669926324155,
          -1.1447992930950621,
          0.0938981670531006,
          -1.0310059131388272,
          0.6591599577121025,
          -0.3944684353247127,
          -0.4996752159405303,
          -1.2016342507372275,
          -3.013848460731062,
          -2.8342858145044896,
          -0.9447860691444592,
          -3.113704719552901,
          1.515694892253786,
          -0.07227804108621905,
          -2.7743642194687084,
          1.7240462697295784,
          -0.7353881491454433,
          -0.2097787689300412,
          0.8241235379171884,
          -1.0071952329124854,
          -1.989492249348416,
          0.8852846842211397,
          2.2019804699237877,
          0.18535893379162738,
          0.8339001233419276,
          -1.6672875562557505,
          -1.2828964697999354,
          4.058536962347264,
          -2.0531879671218323,
          -2.7355225809373024e-57,
          7.204212563691299e-57,
          -3.4166720017690784e-57,
          -5.606282071808367e-57,
          6.523620970266038e-57,
          -3.6520786083092335e-57,
          2.5413240550035046e-57,
          -6.371446811918636e-57,
          3.127283841035023e-57,
          5.410464160816103e-57,
          -3.0817678469699114e-57,
          -1.5869198142242115e-57,
          -1.6517174878521605e-57,
          3.390443832129071e-57,
          -3.5873189099041745e-57,
          -4.578114606562316e-57,
          -6.516232777664375e-58,
          -2.622980019811453e-57,
          4.74763242202646e-57,
          -3.5882833871559845e-57,
          3.0267617319339777e-59,
          6.386776823615636e-57,
          1.7650344544130178e-57,
          5.183793349259305e-57,
          6.348075505201896e-57,
          3.4193802648610497e-57,
          2.6804304785263915e-57,
          6.803762369999624e-57,
          7.24429737335001e-57,
          -6.186460440452898e-58,
          -6.168120711513888e-57,
          -2.789216459897593e-57,
          -4.878163114500521e-57,
          -1.0703988815027379e-57,
          -5.20603666417602e-57,
          1.3593472617567563e-57,
          -1.5359894423701872e-57,
          5.626807151221206e-57,
          6.800935262925737e-57,
          6.018062684945011e-58,
          -3.0472922488155463e-57,
          1.1999056561392696e-57,
          5.648670723724927e-57,
          -1.2137602798389324e-57,
          6.694998419403602e-58,
          -3.0931048821077016e-57,
          -5.715153009498296e-58,
          -1.2809949345793327e-57,
          -3.431418717158952e-57,
          7.4387247584408e-59,
          -2.5392152955134297e-57,
          -1.6689153145806034e-57,
          3.1843530925343084e-58,
          3.4168926324430966e-57,
          -2.2142945504187084e-57,
          6.087731855664757e-57,
          5.106136686940793e-57,
          -6.52947399605185e-57,
          -3.354903172111856e-57,
          -6.928303265859373e-58,
          -5.626588277634912e-57,
          -2.006294750062325e-57,
          3.2636025290719316e-57,
          2.4107801985782152e-57,
          1.6065186127374698e-57,
          2.8367301331691336e-57,
          -4.076688853601516e-57,
          -2.1002556280669148e-57,
          2.3507493275386423e-57,
          5.371293721437816e-57,
          5.601097280294883e-58,
          -2.933855666810241e-57,
          -6.833542232138191e-57,
          2.833988001396739e-57,
          -7.20596702541126e-57,
          -1.673768774973502e-57,
          3.900704761934798e-58,
          6.05469115344332e-57,
          -5.868094377621898e-57,
          -1.224342044478751e-57,
          -6.931772587252222e-57,
          -2.0875791267291772e-57,
          1.604432344553482e-57,
          -2.986098297932406e-57,
          -4.004292172523856e-57,
          -5.451127836553617e-57,
          9.990978067402427e-58,
          2.6192679381734365e-57,
          2.2906794559000725e-57,
          6.4893613971584e-57,
          -7.292948459869901e-57,
          1.9464978003137453e-57,
          1.3092581804499693e-57,
          1.1532948110812028e-57,
          6.717936498151131e-57,
          -7.055661556135863e-57,
          2.636477721680447e-57,
          4.357590641830026e-57,
          1.2450358739014086e-58,
          -2.207911839075979e-57,
          4.013133587229634e-57,
          -5.744187396132442e-57,
          -7.464735406419746e-58,
          2.540631426379516e-58,
          2.6006356346384647e-57,
          -5.84580808477202e-57,
          -3.735880398562398e-57,
          -1.1660880152826268e-57,
          1.6189043830360612e-57,
          5.49323336409415e-57,
          1.5581640268140127e-57,
          -5.172049009441997e-57,
          7.013181269318348e-57,
          5.254223062418602e-57,
          3.4467686671590763e-59,
          6.058506345981972e-57,
          5.302884438464464e-58,
          6.073965902423386e-57,
          4.604917210603658e-57,
          6.809070795794333e-57,
          6.017155515217201e-57,
          -6.737670462965252e-57,
          -4.533479973999697e-57,
          -1.450343443735798e-57,
          6.543131880080277e-57,
          -2.6860644044685293e-57,
          -4.752918563217387e-57,
          5.48285746234567e-57,
          -6.894471606964479e-58,
          5.825979502811209e-57,
          -4.7565719284532874e-57,
          2.1393968459699863e-57,
          -7.696971889901468e-58,
          -6.077309740615617e-57,
          2.6362038716036456e-57,
          -3.4462931580272153e-57,
          -6.678604522263019e-57,
          -6.345566835969567e-57,
          -6.327095116662327e-57,
          5.823697060830248e-57,
          3.260492837022594e-57,
          5.669372109623824e-57,
          2.2994335441602412e-57,
          3.69491896972355e-58,
          -2.623292849921108e-57,
          7.304138825908737e-57,
          -1.8173173428942886e-57,
          -3.747867127823443e-58,
          -1.5979553868242144e-57,
          6.99564096891099e-57,
          -4.5352160107262254e-57,
          -2.2914474974041704e-57,
          2.408447375311513e-57,
          -6.292453130606849e-57,
          1.4015346440745402e-57,
          -2.8484105251189238e-58,
          -2.91517668852607e-57,
          -3.5783854087038463e-57,
          1.84499068837313e-58,
          -1.7386811910070148e-57,
          -5.5753856270763744e-58,
          -2.1589536930628053e-57,
          6.845616209988651e-57,
          -5.172393650638667e-57,
          -5.751192888714387e-57,
          -2.076742683992255e-57,
          1.1838249842811535e-57,
          2.112406802177867e-57,
          -1.340854157032397e-57,
          7.326276191311116e-57,
          -1.9590648814881839e-57,
          2.992933762989597e-57,
          1.8141846243938522e-57,
          4.348108162345082e-57,
          6.940726728412167e-57,
          5.538076498164941e-57,
          3.62227267720238e-57,
          2.661567385699031e-57,
          -2.1865281456825743e-57,
          -4.9505024487618655e-57,
          -6.301749793794249e-57,
          -3.5270230692121084e-57,
          -8.746195648180712e-58,
          2.8025934052485903e-58,
          3.748384069493087e-57,
          6.651539693704936e-57,
          -5.425597298108939e-57,
          -5.588851307010546e-57,
          1.166038443228046e-57,
          3.3408892370336685e-57,
          4.8859793308592895e-57,
          6.276841558258918e-57,
          7.060631919533923e-57,
          -1.30665384616913e-57,
          -1.569551718756909e-57,
          -4.9485928362342616e-57,
          2.4730460562213772e-57,
          2.078875418485082e-57,
          5.102143970639895e-57,
          -5.743946940232727e-57,
          -2.8158849523140368e-59,
          1.0513793003319354e-57,
          -3.532093245702985e-57,
          -4.621424473704503e-57,
          5.0634593487069476e-57,
          -6.368535482018669e-57,
          -3.7514795363372836e-58,
          -5.449062622021112e-57,
          -5.5054054749515674e-58,
          7.0028909417143e-57,
          -9.878845229655042e-58,
          5.0252304371089197e-57,
          -5.425674872400474e-57,
          -3.0989000926855765e-57,
          -1.2531223904643626e-57,
          -1.306513548154139e-57,
          2.282649410407176e-57,
          -2.0583439905560823e-57,
          2.883130240373444e-57,
          1.8362113784798874e-57,
          -1.3152570639255883e-57,
          -8.814896068754087e-58,
          1.4998840131412476e-57,
          -6.181524409769682e-57,
          4.490408220155287e-57,
          2.0325575607233412e-57,
          3.064129773151099e-57,
          4.725360705343646e-58,
          -5.533787308666508e-57,
          -1.2364773856515816e-57,
          -1.2319532663406937e-57,
          -2.3888772062685885e-57,
          -6.838261139559609e-57,
          3.222241216218954e-57,
          -5.544760818799531e-57,
          1.3888464749884525e-57,
          2.7322974454927976e-57,
          1.7758376943311907e-57,
          6.658146214181997e-57,
          -5.647727437977088e-57,
          5.181880976816502e-57,
          -6.850852963349699e-57,
          4.465952895184699e-58,
          -1.2470826783436752e-57,
          3.0833232351203393e-58,
          -1.777397029700998e-57,
          -4.2932208592844775e-57,
          -7.018128911470991e-57,
          2.3098644600779565e-58,
          4.802937582965042e-57,
          -1.6664453888026488e-57,
          -3.808573726636061e-57,
          -6.012084731251006e-57,
          -5.935218365715994e-57,
          -3.830401311202915e-57,
          -5.70000277427752e-57,
          -3.1889201282707424e-57,
          -6.244653955980899e-57,
          -6.25349667829917e-57,
          5.0120311866635937e-57,
          -4.7274759919403334e-57,
          7.689911471228746e-58,
          3.7539031014578694e-57,
          -5.589715805818915e-58,
          -4.862475471047265e-57,
          -4.156835025095606e-57,
          -8.653628623370658e-58,
          3.604044260906365e-58,
          -1.9929566801408202e-57,
          3.8732361044452655e-57,
          3.423141882811231e-57,
          6.137073521599459e-57,
          -6.854791602849495e-57,
          5.631660945172366e-57,
          -1.4039866641759147e-57,
          5.357717167540486e-57,
          2.555706519047479e-57,
          7.126150337793275e-57,
          3.544446738917795e-57,
          -1.785006791464628e-57,
          1.3462058784837371e-59,
          -1.6232080944497886e-57,
          -1.779973872769934e-57,
          -3.2490183800092004e-57,
          -5.106978183070588e-59,
          2.42802794772649e-57,
          -3.010989387666509e-57,
          3.1084870586315973e-58,
          -5.424653494628324e-57,
          -4.762506079049404e-57,
          -6.560372352595673e-57,
          6.849555213376838e-57,
          -7.273499931417427e-57,
          -4.4753604628129917e-57,
          1.4774034559836413e-57,
          -5.998597709241733e-57,
          5.413244551626818e-57,
          2.967213948468553e-57,
          6.777707439938503e-57,
          9.687164646569748e-59,
          -0.7957780906325188,
          -0.323590669400767,
          -0.2913725290642997,
          0.44405195960761196,
          -0.23626239471530544,
          0.9046391502724922,
          0.9648205495125592,
          -0.15221941717385998,
          0.8317730170816684,
          2.9524695406458257,
          -0.14186653344770794,
          0.10788672363078537,
          0.11959827397499115,
          -0.44189531551747785,
          1.0967017182435042,
          0.5745932793798196,
          0.5913868286157606,
          -0.49891928618044473,
          2.0043969602001956,
          -0.12807780997040547,
          -0.07252438215701834,
          0.5735479989998666,
          0.49864493258508075,
          -0.6858154533670524,
          0.030255886009879284,
          0.3015087321247737,
          -1.2257985871608994,
          -0.0009882737451819563,
          0.2835616287028879,
          3.3452013588536977,
          1.6461014783009231,
          -0.23138646821237632,
          0.716965292997931,
          -0.24770428789549523,
          -0.3044493536779832,
          0.006773010414613074,
          -0.20537151899465605,
          0.7756266216824897,
          -0.2604152287486876,
          -1.150373718767804,
          0.3963348993492735,
          -0.41191779862289446,
          0.980348617410723,
          0.21370728555157986,
          -0.5352889403446843,
          0.7839149210287771,
          -0.2530099394053736,
          -0.41447772611167577,
          1.0267987860522068,
          0.3890413349694727,
          -0.7577870967147387,
          -1.0290767581517895,
          -0.6113780677368748,
          -0.35087973751826884,
          1.0538689898473947,
          2.274004247176462,
          1.7415615192728606,
          -0.5369875924067986,
          0.5572703329347276,
          -0.2064097624763656,
          -0.19113471406699326,
          2.0213258014948132,
          -0.8726963518173849,
          1.4296014509083783,
          -0.10061164817178568,
          -1.0748653172683866,
          -0.21778717240705991,
          0.6940723277588714,
          2.4575693757375237,
          -0.12196664625975066,
          0.9395174055433833,
          -0.7903988361289394,
          0.9194187943706547,
          -0.8804456687256083,
          -0.5083270482623988,
          -0.12812710191926524,
          -0.29857865459047217,
          -1.0123953615259491,
          -0.7012501563047521,
          0.7379492118117749,
          -0.3829366306851614,
          -0.4661620907756037,
          -0.9230673382570875,
          1.1129406065741883,
          2.339707064239842,
          0.26266235113157,
          0.9343042320474128,
          -0.9647716470371017,
          -0.5473511056837224,
          1.431306338588572,
          -0.010355282054929504,
          0.01116515271601207,
          -0.3483805283727711,
          2.742662975488091,
          0.2368731461320923,
          0.5412277631860252,
          1.4334594768453464,
          2.6400968123166897,
          -0.9646865190456038,
          3.338810760576838,
          0.2980101222091106,
          0.15770299514411262,
          0.4045124651435517,
          -0.8479805320112201,
          0.8311769733028119,
          0.450095251671026,
          0.17822900339782202,
          0.1173035984736641,
          -0.3887365139350472,
          -0.012641067762912819,
          1.1809152080124004,
          1.7176749023737456,
          -0.6016667466854135,
          0.32726206027814103,
          0.5378049029056133,
          0.012704574546241484,
          -1.3744427907103616,
          -0.5360501971663909,
          1.2302094424869656,
          0.6061964486729101,
          -1.222714910730689,
          0.46496992034540624,
          -0.0029922413990914236,
          0.14579690105370707,
          0.10183956096719267,
          -0.19137491649970023,
          0.3618025742786141,
          0.8228562050818539,
          -0.9025177320212154,
          1.1120854825276665,
          -0.13959859735849742,
          -0.5541503185995618,
          -0.02354512323317499,
          1.5746596452883233,
          1.9331415175163376,
          -0.17514643356883408,
          1.6237564250316907,
          -0.03415321304498116,
          -0.8734392295006945,
          0.6464640413174031,
          -0.3300719085644678,
          -0.5490541479273296,
          -0.6820034828821703,
          -0.33065572520234515,
          1.0348165978919788,
          1.2195378869359184,
          2.101309394170074,
          0.1618736948333042,
          -0.7511964326943811,
          -0.18485695584514922,
          1.6086441643294622,
          -1.9568050801612893,
          0.4201240546513754,
          -0.8480296428805841,
          1.6062294435502722,
          0.3902210947203348,
          -2.8807893822985338,
          0.6424059417557141,
          -0.5905758271119722,
          -0.2894082821118253,
          -0.44050617962331934,
          0.6301039059136917,
          4.658309395023958,
          -0.005222172216282613,
          2.0003098530375567,
          0.244765427880385,
          -2.4783125960590677,
          -0.685799723980555,
          2.498552889628839,
          0.8900677712631646,
          1.570576688647124,
          -2.0343780998318874,
          1.2897666906804592,
          1.3462448999494963,
          0.5422868316118145,
          -0.24246939594048722,
          -0.22503326728275866,
          -0.2182821775418265,
          0.3101821235252169,
          -0.5858801617754771,
          -0.38818313041564834,
          -1.0960209835907926,
          -0.38133097991878606,
          0.7276539984206898,
          0.6010560875247868,
          2.999322142778827,
          -0.9538459777847156,
          0.15512680986584976,
          -0.26152254462623004,
          0.49313603238316683,
          0.09640118290207737,
          -1.7194507191993285,
          -2.410499683339107,
          0.5839991657595575,
          0.18181950786470877,
          -0.5927663070650879,
          0.25111880158775113,
          -2.245987609714049,
          -2.3650318756532704,
          1.1533319450867516,
          -2.1379745513537705,
          -0.29070924037113705,
          -0.36137750139356534,
          1.1829077362382705,
          -1.7512423503800965,
          0.1550917974606654,
          -0.7629648017138387,
          0.21356588804336807,
          -1.6700858081244538,
          4.096205925594016,
          0.4058280304041544,
          1.2453965269420972,
          0.5017089977521957,
          -0.6961807416500214,
          3.2429022076228713,
          -1.9676150092598905,
          -1.5500555871005854,
          0.8938095999368098,
          -1.2015591788519475,
          0.3770336896555918,
          -0.09778217844942426,
          -1.5357696252724553,
          -3.2178618389073304,
          -0.7910906761577514,
          0.21674013822876453,
          -1.5327963890594332,
          -0.21072055754625266,
          0.3031978394270397,
          0.18288588487156765,
          1.4889623946780919,
          -0.8991373838696356,
          3.441672519828966,
          2.2622497409158053,
          2.9181545034830303,
          2.79690096517891,
          -0.8462709681408324,
          1.6466105015703263,
          4.322191709627952,
          0.3711055122463257,
          -0.6720803927838888,
          -0.5815047000010982,
          0.935861979507611,
          0.4281212220525988,
          0.21073259852526066,
          -0.36595651452049677,
          -0.683687641330189,
          -2.107875383126103,
          0.6334566059957254,
          -0.9784231832837731,
          1.4849674128876265,
          0.5262774829641251,
          -1.9987099811660793,
          -0.436042638061462,
          -1.332038925471754,
          -0.2524527184169992,
          -1.5199818905360756,
          -1.6846563811838908,
          -0.12844465564873225,
          -1.22556571270377,
          0.31241265739068064,
          1.4056375302007382,
          -0.36433344941892315,
          -1.0151396913477968,
          -0.5885956911899419,
          -0.24321758551904885,
          -2.4097184004126637,
          0.007927121181443567,
          1.984118433599739,
          0.6828835458423416,
          4.216916158358591,
          -2.426984988749972,
          1.01940706023839,
          1.5456769164444346,
          1.7080216689823033,
          1.4503862250205133,
          0.024659674080274682,
          0.34856978523426846,
          -0.08044026744767052,
          0.8238479349698044,
          0.5613283189659831,
          0.05552542612036612,
          -1.1479931770613938,
          2.0563161057721957,
          0.07688395253301272,
          0.6200474965534541,
          -1.8699191155967,
          -1.04156676128922,
          -1.1757535616532386,
          0.1670972014861862,
          -0.12602059329914753,
          0.3798183690677887,
          0.7168969190174607,
          0.9318258598671896,
          3.3107906455955294,
          -1.9272585403919886,
          0.2404646793974523,
          0.9438046707823119,
          0.718439061363537,
          -2.21492632929083,
          2.6618240486103963,
          -3.180315682285253e-57,
          -7.111815910363288e-57,
          -2.0665476802930716e-58,
          -3.3188210040048654e-57,
          4.510413550353897e-57,
          -3.6616517770363755e-57,
          -2.5357024107140863e-57,
          4.0189374649292583e-57,
          2.902876910477808e-57,
          7.476116166245162e-58,
          2.756978129487874e-57,
          -1.0551137750865697e-57,
          -7.249151667258102e-57,
          -7.147830621352444e-57,
          1.4252193656498798e-58,
          -5.967683183366951e-57,
          -6.49040090923155e-57,
          6.763275270231104e-57,
          5.0544543836907725e-57,
          -4.8832305977963166e-57,
          -7.327248832026436e-57,
          6.371840651540128e-57,
          -2.996794829834254e-57,
          -4.364023824598616e-57,
          2.5659459576934633e-57,
          -5.558719934255011e-57,
          -3.194583525552578e-57,
          6.921936553264152e-57,
          1.840001389822569e-57,
          2.6335701687047e-58,
          -1.3319547366983234e-57,
          3.769419567807804e-57,
          -5.055075449471825e-57,
          6.793378589162395e-57,
          5.087491744768233e-57,
          1.5422973737460872e-57,
          -6.624440876372252e-57,
          2.698653229481436e-57,
          5.912662717927107e-57,
          3.1338215112779736e-58,
          -1.9268880574114702e-57,
          -5.378978563006585e-57,
          3.4800382333980066e-57,
          5.462581809623613e-57,
          -5.696216186714988e-57,
          3.540062377261898e-57,
          -7.05251186210896e-57,
          6.788700612665294e-57,
          1.507066378688152e-57,
          6.742101994946848e-58,
          -2.744169613756556e-57,
          6.17073508501517e-57,
          -3.176353259716654e-57,
          4.578110203016296e-57,
          7.08871664337004e-57,
          3.901826721028763e-57,
          2.4173856839039924e-58,
          -6.245874810083141e-57,
          -3.520665327343687e-58,
          -7.960422836272806e-58,
          -4.108667621011839e-57,
          -9.894566044158506e-58,
          -1.8782182379499723e-57,
          -4.703419460211012e-57,
          -7.551407471167977e-58,
          -3.221453435352479e-57,
          2.8110766269130716e-58,
          -6.752097325395646e-57,
          5.79968078769623e-57,
          4.3983893429037583e-57,
          6.76067991572626e-58,
          4.9426562691065664e-57,
          6.711746921569849e-57,
          -5.53307163311152e-57,
          1.7217152915697472e-57,
          7.304672824805314e-57,
          7.135188010803313e-57,
          1.3486521158362472e-57,
          -5.257256339772929e-57,
          1.0794274812696031e-57,
          -7.303686620449654e-57,
          -4.167154616451373e-57,
          6.608482978438372e-57,
          -2.2571342482627235e-57,
          1.8252683311162976e-57,
          -2.9603130266048973e-57,
          6.472355445373286e-57,
          3.096163615686444e-57,
          -2.268173430198565e-57,
          4.026942319135814e-57,
          -5.570425676006433e-57,
          -1.407356213375634e-57,
          -3.8330550910065456e-57,
          2.4560128019573963e-57,
          -5.661278146694704e-57,
          -1.343959830204786e-57,
          -3.020945083320552e-57,
          8.04412389170067e-59,
          -1.9866327690694296e-57,
          2.7778551213197166e-57,
          -6.927389654942106e-57,
          1.764886864131421e-57,
          -3.694220992906794e-57,
          -3.135711298322562e-57,
          4.154601457977555e-57,
          6.599366237307309e-57,
          -2.4521134707665642e-57,
          4.5575898606412346e-57,
          -5.636713703591489e-57,
          1.7648147117204884e-57,
          3.423297914238116e-57,
          -4.822158608848131e-57,
          -9.57501312048636e-58,
          5.584269970828469e-57,
          -5.643269992040927e-57,
          -7.035237717634529e-57,
          1.1779284790447051e-57,
          -8.318399391190805e-58,
          4.1310145361156833e-57,
          6.076378477803838e-57,
          -2.6985209279040705e-57,
          -1.460217199469883e-57,
          -1.7448088454695834e-58,
          1.1454509490714228e-57,
          7.067767123723385e-57,
          2.648519250041032e-57,
          -1.4447522599076603e-57,
          -3.207391591414281e-57,
          6.420109714139834e-57,
          -5.139433075181234e-57,
          2.9765067705382823e-57,
          6.107701562434259e-57,
          2.188811016816626e-57,
          -9.965186983474165e-58,
          -4.165954813040795e-57,
          -1.7448690652275693e-57,
          2.7844427092355665e-57,
          1.9787805445782543e-57,
          6.149439782557515e-57,
          5.177090771639574e-57,
          4.3951429207299566e-57,
          5.883249497187908e-57,
          -3.025452881659107e-57,
          -1.7168579988133447e-57,
          -1.5755459263600906e-57,
          7.790667367461406e-58,
          2.2383904724006265e-57,
          -2.8761965339190193e-57,
          -7.012471599941182e-57,
          -1.3144344286800235e-57,
          -2.565435289003708e-57,
          6.380270409059331e-57,
          5.513870397253413e-57,
          5.07483023535793e-57,
          2.0267214996112775e-57,
          -2.064292656684515e-57,
          6.273866184460346e-58,
          4.381074837529659e-57,
          -5.722375554500971e-57,
          4.16694684511216e-57,
          -6.652844746652004e-57,
          4.399251748831426e-57,
          4.264928360011699e-57,
          -6.491516948653451e-57,
          1.6715830739492812e-57,
          3.1074049130802076e-59,
          -4.609254861969444e-57,
          -4.939748164360256e-57,
          3.7509887966895855e-57,
          8.742800401301948e-58,
          7.053506401151044e-57,
          7.040975410818055e-57,
          7.215207581834183e-57,
          -5.405169900917524e-57,
          6.316265303306017e-57,
          -3.4878105436616516e-57,
          -5.355681662922294e-58,
          3.516850241533968e-57,
          -4.096264843050591e-57,
          8.56090722731836e-58,
          -4.3652515055685367e-57,
          -5.624868594882259e-57,
          -5.437621592737456e-57,
          -1.8798538284513066e-57,
          -7.260153811981599e-57,
          -9.726937447913386e-58,
          2.1822806472066648e-57,
          -1.2813349752400975e-57,
          -5.927450038459358e-57,
          -6.300889980241676e-57,
          -2.999802828483023e-57,
          -4.6170211851240493e-57,
          6.756309557542985e-57,
          -4.8955675011799086e-57,
          4.2331587746740385e-57,
          1.1182185388165963e-57,
          8.952932490125085e-58,
          1.534699205197737e-58,
          6.866653184137699e-57,
          -1.7946018038431673e-57,
          3.969347295796863e-57,
          7.115209247279606e-58,
          -1.362692528291096e-57,
          6.597682755136006e-57,
          1.2813907009017457e-57,
          -5.400417484890572e-57,
          -1.0696968199237499e-57,
          3.874758438909295e-57,
          2.5976669370735207e-57,
          5.961754820092814e-57,
          -3.2712483802671613e-57,
          3.528426652130041e-57,
          -5.1400108780040695e-58,
          9.523727676334958e-58,
          6.59079521399637e-57,
          6.991635229785816e-57,
          5.0947882309313205e-57,
          -1.8597960555181486e-57,
          5.504941254904672e-57,
          1.8282765281438554e-57,
          -9.04741402422993e-58,
          -6.742476702458709e-57,
          3.704577278976673e-57,
          2.666945584019249e-59,
          3.943519771842987e-57,
          3.3792466898021624e-57,
          4.0540325610701236e-57,
          -2.677212783007588e-57,
          4.162783023514355e-57,
          6.2734832494943625e-58,
          -3.403296449520994e-58,
          2.3350834878219888e-57,
          -6.980899636791164e-57,
          -5.663338117395884e-57,
          -2.7980284726624853e-57,
          7.053355853991386e-57,
          -5.0739504700236004e-57,
          -2.2549571397021107e-57,
          -6.490767870477043e-57,
          -2.2455566022889214e-57,
          -2.398953891041405e-57,
          6.455758522467951e-57,
          4.8396440399509145e-57,
          -1.536584023929888e-57,
          -6.924199788467948e-57,
          4.6222908572807483e-57,
          2.1313102455084723e-57,
          -4.8780118221857396e-57,
          7.272351067055944e-57,
          -5.696507816577903e-57,
          5.181057890077987e-57,
          -2.768192647212524e-57,
          -8.341817638595071e-58,
          4.08240068566403e-57,
          2.368522184082121e-57,
          6.30989027231412e-57,
          1.5896006155556547e-57,
          -5.735137502780518e-57,
          5.452132269669623e-57,
          3.690177030461888e-57,
          2.855948280142823e-57,
          -6.446918216170163e-57,
          -1.354764162426333e-57,
          -4.6458013847186736e-57,
          4.4827387708706957e-57,
          2.693998373846311e-57,
          5.431879380833161e-57,
          6.780767771547471e-57,
          3.773081942960529e-57,
          7.241482369591213e-57,
          1.503163772462756e-57,
          -6.719587444160891e-57,
          -7.099403661301155e-57,
          -2.09462023712802e-57,
          4.506659091436212e-57,
          5.165734922078565e-57,
          6.685657383704397e-57,
          -6.261347977175742e-57,
          -6.597074121572174e-57,
          5.912650767967123e-57,
          -2.614774450947004e-57,
          7.467753429226388e-58,
          7.04426219895493e-57,
          -1.2979693408064466e-57,
          2.2056274962506682e-57,
          -1.2921841712005805e-57,
          3.6759583986127865e-57,
          3.5372020356239665e-58,
          -3.591507903942428e-57,
          -3.0981186563596746e-57,
          -3.290452410580489e-57,
          4.1306615091746236e-58,
          2.731891473006751e-57,
          6.496219333908863e-57,
          2.6024926254085954e-57,
          3.8689621230214674e-57,
          -4.622946488926398e-57,
          -1.6549010543861177e-57,
          -1.1197080804452025e-57,
          2.4934479952389813e-57,
          -2.744994750129941e-57,
          -2.639682008964e-57,
          -1.9039485553171153e-57,
          4.3063837281386316e-57,
          1.005058337532593e-57,
          -6.096839890324458e-57,
          -6.048924449689841e-57,
          -1.6927687060276935e-57,
          3.652245714814194e-57,
          2.5259841174021528e-57,
          2.800311339122354e-57,
          3.6613965521069826e-57,
          -2.8699458943853694e-57,
          6.196615239807181e-58,
          5.558829980010273e-58,
          3.2568332113121066e-57,
          6.620769950818916e-57,
          -3.001626483587003e-57,
          4.0497451226693036e-57,
          2.1234447285530056e-57,
          1.0401737501404741e-57,
          3.775044530332808e-57,
          6.410422359250652e-57,
          -6.72681721877341e-57,
          -4.954931507411232e-57,
          3.500397782607364e-57,
          -5.959637719714517e-57,
          2.0507722048716693e-58,
          -3.8532643208246226e-57,
          -3.0549132372860373e-57,
          2.712676509975564e-57,
          -6.834245794307613e-57,
          5.27828710494667e-57,
          -7.144893088796346e-58,
          3.031624839246161e-59,
          5.130051911035397e-58,
          1.9237044652829304e-57,
          -2.056424213907154e-57,
          -5.682587233267715e-57,
          -2.426354217089197e-57,
          -4.6349673379390476e-57,
          7.224981346674588e-58,
          -2.4312864844787258e-57,
          6.640452054735453e-57,
          6.766871190115347e-57,
          1.5758147070050728e-57,
          1.5401307718719354e-57,
          7.093224224130787e-57,
          5.498332763061726e-57,
          3.62977311641652e-57,
          -2.493859629862989e-57,
          -1.77138016666546e-57,
          -4.1316766035967857e-57,
          -1.633039208741948e-58,
          7.176686292522397e-57,
          5.894476898502854e-57,
          -5.409365800464082e-57,
          -6.917203910166809e-57,
          5.678529790327405e-57,
          4.7573371080839426e-58,
          -4.1478909018890243e-57,
          2.3144372147758943e-57,
          1.9054961384614402e-57,
          -5.350506928484862e-57,
          -3.268003185612115e-57,
          -6.343389405840893e-57,
          -4.002636562970566e-57,
          -5.190128683079927e-57,
          -4.2528276248990963e-57,
          2.48056124990047e-57,
          -6.516208180010664e-57,
          -5.670693543055822e-57,
          -5.16091467474255e-57,
          -2.4522415662731551e-57,
          -2.704263102907239e-57,
          -3.3341456160335495e-57,
          3.41603774961908e-57,
          7.30515700045938e-57,
          4.344648587160825e-58,
          6.413202111602529e-57,
          -1.3495520848364878e-57,
          -5.5939571573997e-57,
          -1.1864867213606475e-57,
