{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid1",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "61",
          "150"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          0.6388854522386155,
          3.560675425834008,
          -1.752745571331793,
          0.8490499790315378,
          1.8977660994496692,
          -1.5254461440019236,
          2.1634864447133304,
          6.85300225831651,
          1.3421612146641135,
          1.2734848929585003,
          1.5079596148448582,
          3.1590630201782415,
          3.813297871041139,
          0.8778345014878004,
          -5.508521127313881,
          -0.0850903016626972,
          -4.058880396030535,
          -3.6587281556834177,
          1.8647190795712723,
          1.0505498402371487,
          0.7170933891896238,
          1.2370216362047122,
          4.259858144081586,
          -1.0063212685521066,
          -0.45843112615615284,
          -0.6331396187287434,
          -3.622004101711049,
          0.4648038808350304,
          -0.51638514290571,
          0.8536196345749428,
          -0.5486406487456211,
          0.7296674025933895,
          5.535853887314963,
          -3.2407011343775354,
          4.640210921542409,
          0.632459640667798,
          1.6813774137057196,
          1.4857444550753294,
          2.6878973354951645,
          1.9690971919453066,
          -1.4440557458887189,
          -2.203526031218321,
          -0.9509866950642473,
          -1.2659188163081998,
          3.25937027462702,
          -1.5213098951297477,
          0.396259938647561,
          -2.023808392015518,
          -2.072511248660242,
          -1.7413887520839224,
          -2.7438731354215555,
          1.2400241093778157,
          1.5569674011953005,
          6.972747036862755,
          -0.9471486995839449,
          -0.3844014056168799,
          2.6964013528262027,
          0.8285718493159997,
          0.5308100026940611,
          0.12820411453768668,
          3.2179037139183064,
          -0.533988626602434,
          -0.026355027032903718,
          -0.7833377013748799,
          2.5362824221705065,
          -1.0842338150027138,
          -0.745774461173298,
          -1.9689879132564716,
          -0.13913138673653216,
          0.8600256073281463,
          3.8596915852568205,
          0.6022969594168287,
          0.007811386902740565,
          2.9157331535574977,
          2.658643421394389,
          -4.08512059341936,
          2.328059263953048,
          2.337753107332208,
          0.6643899936454543,
          -0.0016814662141875262,
          -0.8006155476777748,
          3.6168359631486355,
          -2.574695360918048,
          1.5145277172871272,
          0.5614921067911085,
          -0.22916182425551165,
          -3.3621906255103133,
          0.44789713854811275,
          0.9666677432956285,
          0.6836142717847621,
          1.3071248529167856,
          3.693488307900835,
          -0.5112464002273982,
          0.3041554313988143,
          2.060449156273241,
          1.5978136125233113,
          1.2883281113911802,
          -2.028825442220181,
          1.6873734582580193,
          3.1325722265177998,
          1.0132632454706838,
          -0.9802885083717942,
          -2.3842222962315316,
          1.4099506219883537,
          -0.9671691805762577,
          -4.3594028099649025,
          3.471668363926004,
          -0.127589344857389,
          -2.7097423428809426,
          1.6071136573566787,
          -0.008461860877687952,
          -0.7188069571785547,
          1.1337513332659162,
          1.613765381885006,
          1.750184225927422,
          -4.265735256728641,
          1.9009566136687013,
          3.851225735607656,
          0.24065754968516748,
          0.8894482309339938,
          -2.9941530096362143,
          -0.6667641338854137,
          4.009022187468549,
          -0.622572237299656,
          2.415943215786252,
          -3.098968028429361,
          -3.209012460662377,
          -1.75085678234668,
          -0.7640831214135896,
          -2.0082808199898814,
          1.8099146850470147,
          -0.21166932174505854,
          -0.07107860895382152,
          0.6943818725650707,
          0.47161936595574594,
          -0.9380544059123436,
          -1.2641303715378898,
          -1.6258805001392425,
          -0.6919080202220431,
          1.0759417461742697,
          2.104055730219761,
          3.5441070024083645,
          -1.0215359074542363,
          0.9838389604635689,
          1.0140987749059125,
          3.6806607811025938,
          1.6330005973723858,
          -2.2144048014598496,
          0.42236431496940186,
          0.5069512782668567,
          -2.3445478691092854,
          -1.4350030780675727,
          1.9252276301755198,
          -1.4720400103449802,
          0.6708738867741068,
          0.3404825893297809,
          -0.00811316319425312,
          -1.8903837946838336,
          -1.506279575445556,
          -2.5141893746400448,
          -0.5535986613403118,
          -0.3928485392369891,
          -0.887640117281707,
          0.5788595999107339,
          1.6500373316667378,
          -0.9900999682959228,
          0.12665116989471956,
          -0.15431406959886393,
          -0.4990324746045866,
          -2.7358589574437615,
          -0.07884567165674618,
          -0.4874161369679575,
          -0.1775462972100312,
          2.393926903020619,
          2.0695007369703986,
          2.829894962436422,
          0.2889422895358088,
          -1.4094411183466016,
          3.1140935945158303,
          -3.0184369071916106,
          1.3718526893524043,
          -1.603914798564219,
          0.17311999916527318,
          0.8468085749552825,
          -1.8166846027714876,
          -1.4806128215406795,
          2.7518438239962015,
          0.12176399847029817,
          0.7967529563763917,
          -4.3017013048657295,
          -0.5375177531508053,
          -0.3755553289084838,
          -0.5325096705593559,
          0.7885520449409069,
          -0.7866237834109044,
          0.6925276499459294,
          -1.9952677171758626,
          1.9843203489597177,
          0.5923646867664274,
          2.4417331342251445,
          0.3868173647798506,
          0.671385570377066,
          -0.8151875772024804,
          -1.7294582395352531,
          1.558593024094088,
          2.030637679320231,
          -1.706800741671543,
          0.06778262839808637,
          0.5417625265617518,
          0.8617751884344972,
          -0.6780419455052454,
          -0.6096266537305102,
          0.20980541938872194,
          0.9428001195003857,
          -0.14762381478786554,
          2.8027187951831074,
          1.2074183157497185,
          1.9069655476449212,
          0.5726296808045723,
          -0.2652273121679933,
          -0.881554465385526,
          1.353194949125516,
          -1.1166613811358652,
          -1.0695118987266077,
          -2.40604109341081,
          2.5758190547892204,
          0.3285959882363525,
          -1.9826131783701753,
          -0.5480712874233582,
          0.45754238629358673,
          1.0960274883690155,
          -0.7122336039594428,
          0.4635726293460815,
          -0.02409258208844732,
          -1.2049824767542838,
          0.5534259713022863,
          1.780391527341944,
          -2.9672952303639577,
          -1.260646073265419,
          -2.5368283235303166,
          1.141526833997822,
          -0.9647640835217395,
          1.1576305401425255,
          -0.32780232467144366,
          -0.7296159885891265,
          -1.093288980490471,
          -0.775778062008215,
          0.9752986288086538,
          0.37795103408828035,
          -1.3011028867758856,
          1.1854090620715094,
          1.5672086984807114,
          0.9498899778467177,
          0.8308547608938681,
          3.7011199503650603,
          0.13403397641773376,
          -0.929894963334619,
          -2.2366922914287994,
          3.0655741611221416,
          -0.5287187373090183,
          0.10688856096717116,
          0.033977441509559544,
          -1.453328572302947,
          -0.948096572504217,
          -1.340086353604526,
          0.9078541693075936,
          0.36601121288132993,
          -1.9352323437675993,
          0.7142410979522605,
          0.9285698416151199,
          0.4070145384993567,
          1.1951332569173765,
          -0.9071699318632533,
          -0.052174540047154924,
          -1.7054320122131588,
          1.3496162580612,
          1.8481884534449806,
          1.0862924096545854,
          -0.41278391734198966,
          2.375491475358607,
          2.1522270109460155,
          1.4511531239491209,
          2.8803049348897756,
          -1.0321203399283105,
          -0.788202085712456,
          0.7155619243047601,
          -0.4639013665895171,
          2.712557022831181,
          0.4868782899328614,
          -0.8409614434511355,
          -2.639125414794318,
          -1.6363353941080592,
          -1.8521017814336003,
          -1.0462736569845845,
          -0.8701972719512373,
          -1.4484773334413197,
          -0.9934579482863151,
          4.243507070893139,
          -0.9402960720151183,
          0.3711214891313832,
          2.205086690098748,
          -0.8245953740097329,
          -0.9124116370768006,
          0.7186136205634202,
          -3.048222867128674,
          0.03406545781912862,
          -1.2690758569669165,
          -0.7079226490278373,
          0.8380441822215945,
          1.1861407074405388,
          -0.16510772883633631,
          -1.5893886234468562,
          -0.8337461292221765,
          -0.8615120392010415,
          0.3670749137150382,
          1.4696993193702736,
          1.1374872472182835,
          2.29585802494317,
          -1.1697379121676235,
          1.9604938627624835,
          -0.873260395216808,
          -0.39607816119274236,
          -3.4447034202814524,
          -1.8276265415981803,
          -2.322332376596498,
          -2.8251021558074347,
          1.7611352655993044,
          1.6067206367967173,
          -3.39373978070381,
          2.018651515481972,
          -1.2098802677016853,
          1.631450828532376,
          -2.7406909032329247,
          0.8686329432010567,
          -0.8092093236251857,
          1.1532866823962673,
          -4.0913363872425155,
          -1.32363209527972,
          -1.435329838925333,
          2.522505220212858,
          1.766025644577726,
          2.57665057039409,
          0.7287412629760178,
          -0.02031141832416231,
          -0.9211409462808882,
          0.1574342522803856,
          1.2771676356855535,
          -0.8126719525405853,
          0.7197125487498226,
          -1.6686214091169125,
          2.686425237150601,
          -1.2051582100350142,
          -0.16757433721972176,
          -1.5008111970126226,
          -1.187375486310475,
          -2.7370968053618006,
          0.24894228779293764,
          -0.59801048734496,
          -0.7249911169856146,
          -0.8026215168576865,
          -1.634598254684248,
          0.6829834864555586,
          -0.30260639342150947,
          -0.4624901058763992,
          -2.1020164626212003,
          -1.8296091344440377,
          -0.4152000666811963,
          -0.7417506336037719,
          -0.4831819609420853,
          -0.3519993985388284,
          -0.8272755646966293,
          -1.7362850796570306,
          1.1605828294468759,
          -1.204304711601428,
          1.1157752610535918,
          -0.7239696630924972,
          -1.1874534766073401,
          -0.6332284388842057,
          0.05748137769962892,
          -0.6143445991930896,
          -0.2830712985751132,
          -1.571378734369503,
          0.9302040860622387,
          -1.2135263520457829,
          1.0119279446931286,
          -0.5343923227318622,
          -0.01788184496134372,
          2.2624726276560003,
          0.7054593318104901,
          1.6510386059206075,
          -2.866899352601404,
          -0.7778844353132697,
          -0.5493412118688581,
          0.11849468678110145,
          -0.13163805748431542,
          0.4205036534886744,
          0.027794769430501253,
          0.37553983066876656,
          -2.2388497741430142,
          -0.4449009942446603,
          -2.3679215471639004,
          -0.48422323587349086,
          0.44367952242038533,
          -1.4848544373788823,
          -3.104049881863592,
          2.5212608493505724,
          -1.062563108715877,
          2.1703916191829777,
          -1.822484233608967,
          -0.8295912554722207,
          -0.8891478863499711,
          0.38564156063274124,
          0.9647449133235666,
          -0.31232272141490336,
          0.12921997693581996,
          1.456655273350831,
          -1.7990402702801171,
          -0.30768674343126146,
          -1.0964964110226738,
          -2.043591777626743,
          1.723246917467248,
          -0.6363306065220354,
          -1.737524026426618,
          0.3242035487386676,
          0.29485883568652793,
          0.391103035023977,
          0.27590158002295057,
          -0.13520221711518535,
          0.8855092553344557,
          -1.0856031498070673,
          -3.9434449868606967,
          -0.9691911794875642,
          -3.426240414200287,
          0.800957421427917,
          0.31096249189230524,
          0.20619960951410793,
          1.1947685148715568,
          -1.7546628783617089,
          -0.04575592102346522,
          0.37784814128938754,
          1.047393132240803,
          -0.02523392670932988,
          2.690497870989422,
          0.2237642120118651,
          0.2947954379990509,
          -0.29382413380288364,
          -0.32574281215899603,
          -3.6653775784110127,
          1.3501660378645786,
          -0.7251708806031338,
          -1.3943289750332643e-59,
          3.670035805274528e-59,
          -1.741360564085758e-59,
          -2.856540154047339e-59,
          3.3235842590896923e-59,
          -1.86128178239013e-59,
          1.2953778751688902e-59,
          -3.246114187644047e-59,
          1.5939304801565799e-59,
          2.756831623474782e-59,
          -1.5707411909878663e-59,
          -8.090013639277624e-60,
          -8.420270302671409e-60,
          1.727998940285058e-59,
          -1.8282924755583944e-59,
          -2.3329591860709067e-59,
          -3.322385397579857e-60,
          -1.3369851137865392e-59,
          2.419292257779221e-59,
          -1.8287837947396774e-59,
          1.5433783936766441e-61,
          3.2539186271352545e-59,
          8.99780295031008e-60,
          2.641407753371248e-59,
          3.234215913243024e-59,
          1.7427402510663696e-59,
          1.3662580782671873e-59,
          3.4661945751954523e-59,
          3.6904392773390457e-59,
          -3.1542622059311747e-60,
          -3.142599422158108e-59,
          -1.4216870594910097e-59,
          -2.48576746047997e-59,
          -5.457230101111172e-60,
          -2.6527346086583374e-59,
          6.930089542475068e-60,
          -7.830430830251063e-60,
          2.8669910740011243e-59,
          3.4647554335213083e-59,
          3.068409719284477e-60,
          -1.553176538675585e-59,
          6.117381103820976e-60,
          2.8781234741064643e-59,
          -6.188002569827468e-60,
          3.41352229063263e-60,
          -1.576517158621344e-59,
          -2.9139793406700135e-60,
          -6.530715283757047e-60,
          -1.7488730621429428e-59,
          3.793060205866749e-61,
          -1.2943033595717848e-59,
          -8.507922107939014e-60,
          1.6236646772797978e-60,
          1.7414729613495495e-59,
          -1.1287333778210924e-59,
          3.1016716617043002e-59,
          2.6018625893098575e-59,
          -3.3265639166943117e-59,
          -1.7098930435680135e-59,
          -3.532463214826006e-60,
          -2.866879628620197e-59,
          -1.022735408430171e-59,
          1.6633799558220205e-59,
          1.2288583190780235e-59,
          8.189904168931659e-60,
          1.4458958959907538e-59,
          -2.0775702311118e-59,
          -1.0706191716024947e-59,
          1.198268400566244e-59,
          2.7368859132673544e-59,
          2.8558307272599057e-60,
          -1.495381715086912e-59,
          -3.481353993248232e-59,
          1.444498752020828e-59,
          -3.670928843018924e-59,
          -8.53265856384189e-60,
          1.988902571790456e-60,
          3.084849701062898e-59,
          -2.989845760444361e-59,
          -6.241941036456173e-60,
          -3.531357435059808e-59,
          -1.064159121127662e-59,
          8.179270969526499e-60,
          -1.5219990269970625e-59,
          -2.04069427444609e-59,
          -2.777537513062564e-59,
          5.093767884505027e-60,
          1.3350936669607664e-59,
          1.1676581275833667e-59,
          3.3061433275994024e-59,
          -3.715202829686918e-59,
          9.922614295425332e-60,
          6.674778547758582e-60,
          5.879788630844743e-60,
          3.422504458744486e-59,
          -3.5944207851658e-59,
          1.3438626912075897e-59,
          2.2206443608382165e-59,
          6.348480433347311e-61,
          -1.1254807960479625e-59,
          2.0451977692409442e-59,
          -2.926757626478626e-59,
          -3.8059381063543097e-60,
          1.2954511010830554e-60,
          1.3255997721199487e-59,
          -2.9784986573355857e-59,
          -1.9039705750572132e-59,
          -5.945000569096395e-60,
          8.253031289795706e-60,
          2.79897739752063e-59,
          7.943451087116844e-60,
          -2.6354272176591607e-59,
          3.5727971719623996e-59,
          2.6772721428720273e-59,
          1.757543319933705e-61,
          3.086792130041756e-59,
          2.7037930449046766e-60,
          3.0946630379399616e-59,
          2.34660960311408e-59,
          3.4688968323928045e-59,
          3.0657390977195603e-59,
          -3.432550206438457e-59,
          -2.3102268298416337e-59,
          -7.393900579717186e-60,
          3.3335168564758025e-59,
          -1.3691287320950786e-59,
          -2.42198436251809e-59,
          2.793694068315049e-59,
          -3.515215578940522e-60,
          2.9684028562506917e-59,
          -2.423844931791722e-59,
          1.0905657243576167e-59,
          -3.9243317134662643e-60,
          -3.096365479410778e-59,
          1.3437231547203924e-59,
          -1.756450600584343e-59,
          -3.4024820504811607e-59,
          -3.2329387524947735e-59,
          -3.223534799883941e-59,
          2.9672407391150954e-59,
          1.661795705585089e-59,
          2.88866406843726e-59,
          1.1721190466298082e-59,
          1.8839817646229085e-60,
          -1.3371445125469579e-59,
          3.7208987263361364e-59,
          -9.26426256156534e-60,
          -1.9109776816462617e-60,
          -8.146259459033596e-60,
          3.563868631223289e-59,
          -2.311110995287114e-59,
          -1.1680495075266033e-59,
          1.227669591760266e-59,
          -3.2058984662166244e-59,
          7.145121711998127e-60,
          -1.452378845459734e-60,
          -1.4858648008980826e-59,
          -1.8237416105586846e-59,
          9.407584491550478e-61,
          -8.863492174933497e-60,
          -2.842722222543941e-60,
          -1.1005319100280247e-59,
          3.4875002170147967e-59,
          -2.6356027185068453e-59,
          -2.930324568415544e-59,
          -1.058636762541189e-59,
          6.0354124093746e-60,
          1.0768114905189312e-59,
          -6.83582803897996e-60,
          3.732166608571174e-59,
          -9.986659600814875e-60,
          1.5254816301575135e-59,
          9.248296775873861e-60,
          2.2158147208493785e-59,
          3.535915425296041e-59,
          2.821811038233661e-59,
          1.846098375607521e-59,
          1.3566467379275737e-59,
          -1.114583786506723e-59,
          -2.522606778775732e-59,
          -3.2106314364540806e-59,
          -1.7975766411378833e-59,
          -4.4592135497391805e-60,
          1.4290181008527419e-60,
          1.9103398951102803e-59,
          3.3887042849103926e-59,
          -2.7645374184012077e-59,
          -2.8476647546261853e-59,
          5.944747881506447e-60,
          1.7027537161820742e-59,
          2.489747952951381e-59,
          3.197950528487943e-59,
          3.596950822247652e-59,
          -6.661503796872858e-60,
          -8.001492035841531e-60,
          -2.5216343027792243e-59,
          1.2605866135565293e-59,
          1.0597236264289027e-59,
          2.5998293567291463e-59,
          -2.926635194987608e-59,
          -1.4358505177616179e-61,
          5.360277178403023e-60,
          -1.8001595016775517e-59,
          -2.3550166186165774e-59,
          2.580129683085096e-59,
          -3.244632039963458e-59,
          -1.9128194869433408e-60,
          -2.7764859130144326e-59,
          -2.807044374789226e-60,
          3.5675590893902596e-59,
          -5.036606712414512e-60,
          2.5606619071473525e-59,
          -2.7645769191717473e-59,
          -1.5794696833905492e-59,
          -6.388642383798918e-60,
          -6.660788672885717e-60,
          1.1635661581204418e-59,
          -1.0492605695742724e-59,
          1.469537074225637e-59,
          9.360555038452039e-60,
          -6.705355877402658e-60,
          -4.4942356438312115e-60,
          7.646405839653213e-60,
          -3.1494234765048716e-59,
          2.288290224353777e-59,
          1.0361194208858849e-59,
          1.5617549515124652e-59,
          2.4093506376220704e-60,
          -2.8196270388087033e-59,
          -6.303798356400292e-60,
          -6.28073764538557e-60,
          -1.2176972713839712e-59,
          -3.483756141326609e-59,
          1.6423081008058084e-59,
          -2.8252146031685774e-59,
          7.080449453079057e-60,
          1.3926856933340292e-59,
          9.052861945525569e-60,
          3.392067442436484e-59,
          -2.877643177002113e-59,
          2.6404339226251027e-59,
          -3.4901659665780153e-59,
          2.2770935482338982e-60,
          -6.357856406733375e-60,
          1.5721531280330043e-60,
          -9.060809125742019e-60,
          -2.1878591741770967e-59,
          -3.5753156649796955e-59,
          1.177788681538858e-60,
          2.4474576879440696e-59,
          -8.495333714029374e-60,
          -1.94099999846545e-59,
          -3.063157386471901e-59,
          -3.024021723869769e-59,
          -1.952118676491637e-59,
          -2.904260300471007e-59,
          -1.6253322461443734e-59,
          -3.1815635602064337e-59,
          -3.186065472585007e-59,
          2.5539402528308387e-59,
          -2.409027042395507e-59,
          3.920732340597638e-60,
          1.9131512618670977e-59,
          -2.8500281412090645e-60,
          -2.4777783376862962e-59,
          -2.118392731886757e-59,
          -4.412024630550299e-60,
          1.8376486821901808e-60,
          -1.015938046129766e-59,
          1.9739379753539944e-59,
          1.7446565535156701e-59,
          3.126792687304842e-59,
          -3.4921709142980216e-59,
          2.8694625125491173e-59,
          -7.157619759874724e-60,
          2.729972649525145e-59,
          1.3027064249994498e-59,
          3.6303010699802686e-59,
          1.8064526322098023e-59,
          -9.099592362536347e-60,
          6.864466406647455e-62,
          -8.274966161994588e-60,
          -9.073942044522743e-60,
          -1.6559499678852239e-59,
          -2.6040948552603095e-61,
          1.2376471624379173e-59,
          -1.534680767055713e-59,
          1.5849832858041242e-60,
          -2.7640568343277845e-59,
          -2.426867045796173e-59,
          -3.342293588203678e-59,
          3.4895053521101263e-59,
          -3.7053034978745e-59,
          -2.2806262938914924e-59,
          7.531824240611384e-60,
          -3.0562906642207267e-59,
          2.758247400652908e-59,
          1.5123776029408355e-59,
          3.4529312556012962e-59,
          4.939539178401412e-61,
          -0.7826815834717175,
          0.733193163029848,
          0.9841998707863804,
          0.33525191206857213,
          2.1922231154503398,
          0.6898786838928274,
          1.7145595867558907,
          0.0935357832732431,
          0.30782500163835325,
          1.1870627626902088,
          -0.3493702149751633,
          0.28017523109653397,
          0.46930522627624793,
          -0.60437953826797,
          1.3702038648689794,
          -0.10610224419880171,
          1.199010028981094,
          -0.13028243612470222,
          0.9907632627268806,
          -0.7255271481610168,
          2.048697503793599,
          0.12574015047486595,
          0.5884826773086967,
          -0.8543960759556389,
          0.1813260950845131,
          -0.3839476059216801,
          -0.9477620975527823,
          -0.21114572863750514,
          2.6996052039968164,
          0.8841605024300218,
          -0.4406975975933705,
          -0.39728024512973303,
          0.4727565206009068,
          0.3851360039374356,
          -0.963479337196499,
          -2.139350951289083,
          -0.43696275545229885,
          1.3132221775339783,
          0.41515389627859567,
          -0.6449462570905393,
          0.29005783841116206,
          -0.9127201198247615,
          4.723269614557079,
          -0.4699890727187237,
          -0.5634538158781909,
          0.4214900140416175,
          -0.2964261038294096,
          -0.45283041454226775,
          1.00584531208622,
          1.4921212905034333,
          0.5261857790807032,
          -0.6161375473818395,
          -0.979824166059111,
          0.29517687986298635,
          -0.2064566770409636,
          0.9003815483403773,
          2.416941047564415,
          -0.7426815447089006,
          0.37639978565694254,
          0.0683813300972858,
          0.09964802710756426,
          2.727468104209743,
          -0.9890284408534363,
          1.1221410355177648,
          0.059024408545420945,
          -0.6995997516616279,
          -0.0941688079038001,
          0.6623219855039642,
          2.8035551895266173,
          0.14713092975919925,
          1.2785380680892033,
          -0.802071266838648,
          0.41136662589829526,
          -0.8557028796307867,
          -0.10021173188795487,
          -1.424567746087853,
          -0.15690967728096883,
          -0.37198140017404324,
          0.24845098483498218,
          0.3232913262680509,
          -0.08311772301618846,
          -0.19348310512568806,
          -0.9711304579114549,
          -0.28728548478924176,
          1.5492409779629785,
          -0.42755963577337824,
          -0.7784970822183246,
          -0.4174929894241454,
          0.23656112305040944,
          1.1332524937644766,
          0.08923514155743477,
          -0.11452456241928632,
          -1.0085338687281225,
          0.19555467113584382,
          0.7357637123444039,
          0.7015311161328475,
          0.9026267545263894,
          0.9919273954010286,
          0.257467188005189,
          3.350810134959461,
          0.037327375842519064,
          0.2721183495856561,
          0.601102670437483,
          0.19862386265196325,
          0.25754692097415005,
          -1.7708650558519712,
          -1.0873386359341526,
          -0.6712969860318739,
          -0.4042086641307278,
          -0.6833615911259454,
          2.5045958592091617,
          5.4606506855149135,
          -0.2587473609115644,
          0.303223947747814,
          0.7877557600457682,
          0.26046963455342476,
          -1.3900449250490907,
          -0.7577093385126097,
          0.18094112206359267,
          0.8277215479394431,
          -0.7189564390086469,
          -0.12103246978294704,
          0.09153023701608336,
          -0.15361462458347508,
          -0.48080446969977547,
          -0.07335005871407309,
          -0.17481029775109608,
          0.9867824571043354,
          -0.4612502111685048,
          0.4941337073604794,
          0.8067728672148027,
          -0.12669513092008605,
          0.11286517517051164,
          -1.2438783685362402,
          0.797455214382763,
          -1.5563131559243035,
          1.5734727551765548,
          0.9288592578192238,
          -0.23542096959242279,
          -0.7378461408251111,
          -0.6056638819370123,
          -0.41725064726870204,
          -0.19405056750758565,
          1.1275448716508405,
          1.3390057913185536,
          1.6288420304709734,
          0.20310823633729894,
          0.4897943589071952,
          -0.2359003390391604,
          -0.08891740739987891,
          0.40428336151891436,
          -2.4479905055658513,
          0.41781011530244444,
          -0.07378373306909168,
          2.918244026329041,
          1.0767822664630393,
          -1.5725746584154774,
          -1.9831989580145142,
          -0.20671943174670213,
          0.11654837633404588,
          -0.5063131462971706,
          0.24705948663169314,
          1.8015996219193262,
          -0.6857812218388653,
          0.36688335065102884,
          -2.3441269011310437,
          0.5233542489386348,
          -0.6445851316019403,
          3.4392930969293207,
          0.7476274072032456,
          1.0848579301019827,
          -0.9727072947091553,
          0.9709271897080236,
          0.8992588588463684,
          1.1411878223693284,
          -1.5536818262943097,
          -0.661613646072938,
          0.19781060128075548,
          0.9280979975408327,
          0.9420810841420751,
          0.26500392199439704,
          -0.3496679623084946,
          -0.2898048042476727,
          -0.5147172705656358,
          0.7899677454306521,
          0.19462681209254445,
          0.28994843161437006,
          1.0217728365979881,
          -1.9024982607825087,
          1.2554078485715463,
          0.10102111449606381,
          -1.016468259232514,
          0.3709501862574537,
          -0.4742990474614533,
          0.754390048575114,
          -1.6742876140828125,
          1.4343105344258533,
          -2.1092290450383264,
          -1.7733395599495925,
          3.5354937320093915,
          -1.7199215953218883,
          0.8527447396110011,
          -1.460036597960831,
          0.7008977605690508,
          -1.2242055552556015,
          0.012741706498968478,
          -1.2742895292773955,
          0.2756276892617346,
          -1.1470652816366687,
          3.0812072811399673,
          -0.031971897549929316,
          0.2525191624678027,
          0.5101884672791169,
          -1.270163397099696,
          2.1324657603879786,
          -1.9994709582732542,
          -0.5982851097221176,
          0.19420937991150505,
          0.01871852362948348,
          -0.07340941506500896,
          -0.47116389015528526,
          -0.22197913738183392,
          0.6280849562010163,
          -2.5191941994011158,
          -0.6000370516854303,
          -0.9815927237163888,
          -0.1227902206013791,
          0.5217816258811256,
          0.1913967488051344,
          0.13453297952876922,
          -1.1678109606901823,
          2.1498451269855825,
          0.9480335721891076,
          0.5925634627165313,
          -1.124977189176451,
          0.4041105562834849,
          1.3279279009599043,
          2.493297048393864,
          -0.8488639458149707,
          2.2640639268964216,
          -0.6035747041680734,
          0.8627294856851032,
          -1.2908567167455247,
          -0.6544569311651003,
          -0.38401354680620553,
          -1.2359754880649663,
          -0.8927113710630555,
          -0.75769272167287,
          -0.7907866998612864,
          0.9634712600415222,
          0.739018276603042,
          -0.7691005863858715,
          0.024910419026048576,
          -0.1199986424590934,
          -1.2307382389138903,
          -2.441171700254101,
          -1.7104887282688837,
          0.4829226882947087,
          -0.7881866877206857,
          0.05618302620978545,
          4.529941383639136,
          -0.3770682058190976,
          -0.9915742763874353,
          0.41298642984541334,
          -0.5669357471776572,
          -0.8837832313437916,
          -2.3668545431882584,
          1.9523469952108927,
          0.909673759576628,
          3.632860952597804,
          -1.3237594703367015,
          1.5982607678773235,
          -2.3550312978310846,
          0.7230373291332637,
          0.500096061606188,
          0.17516952081877527,
          -2.102914712406271,
          -0.7308944205400892,
          4.34645752259252,
          -1.0494079517999255,
          0.32044953857811465,
          -1.733525011686417,
          0.31849851323077627,
          0.14447305476636346,
          0.7429207653055195,
          -0.29284607253267037,
          2.8366624849761313,
          -1.3479488377932751,
          0.13601747811741471,
          -0.12903983792699195,
          2.1796901023378505,
          -4.234539936952254,
          0.7133628552251123,
          2.5184711856910393,
          -0.29661320365777005,
          -0.5234486498875973,
          1.8319945466979408,
          1.091343888434594,
          -1.9225097575737446,
          0.8667316075139273,
          -1.6209485782024964e-59,
          -3.6230045836510507e-59,
          -1.0537265315801842e-60,
          -1.6915111180380273e-59,
          2.2984790409770386e-59,
          -1.8661584165811709e-59,
          -1.2925133724873838e-59,
          2.0481540481346747e-59,
          1.479598056086353e-59,
          3.811740009293509e-60,
          1.4052610427829516e-59,
          -5.379313824226436e-60,
          -3.6929101386424054e-59,
          -3.641336691791452e-59,
          7.267222231714303e-61,
          -3.040550906019162e-59,
          -3.306672526291587e-59,
          3.4455844973839266e-59,
          2.5755439896606098e-59,
          -2.4883481317966196e-59,
          -3.7326616799409773e-59,
          3.246314689923128e-59,
          -1.5274488036268863e-59,
          -2.2239209193989472e-59,
          1.3079238896479095e-59,
          -2.8323223784710726e-59,
          -1.6282175462710322e-59,
          3.5263505190904625e-59,
          9.379870576323205e-60,
          1.342838056360225e-60,
          -6.790466485936492e-60,
          1.9210552507731274e-59,
          -2.5758602618427697e-59,
          3.4609086971296484e-59,
          2.592367908756562e-59,
          7.862581402687781e-60,
          -3.3749091399563785e-59,
          1.3755431001093567e-59,
          3.012537642769481e-59,
          1.5979004316396643e-60,
          -9.82267721526739e-60,
          -2.7407990721486325e-59,
          1.773641370134629e-59,
          2.783369827637726e-59,
          -2.902332287232981e-59,
          1.8042191478858153e-59,
          -3.5928175122111563e-59,
          3.4585273630286625e-59,
          7.683013631339802e-60,
          3.4375361855373047e-60,
          -1.3987348331701429e-59,
          3.143930446387598e-59,
          -1.6189298576539695e-59,
          2.332956943362563e-59,
          3.6112465890342196e-59,
          1.9885014141189303e-59,
          1.2326112199427335e-60,
          -3.1821851089101696e-59,
          -1.7951372604507614e-60,
          -4.058637412237292e-60,
          -2.0938587279343743e-59,
          -5.044620613078396e-60,
          -9.574639066981452e-60,
          -2.3967755315556802e-59,
          -3.8501234124329394e-60,
          -1.6419067573825117e-59,
          1.4333434379017719e-60,
          -3.439894301459234e-59,
          2.9550126949571913e-59,
          2.241423935292207e-59,
          3.4470073945338724e-60,
          2.518611085219896e-59,
          3.4193535921793634e-59,
          -2.819262625939272e-59,
          8.777024077875211e-60,
          3.7211705314729055e-59,
          3.6349014004049803e-59,
          6.87557520040955e-60,
          -2.67881674316914e-59,
          5.503253493142548e-60,
          -3.720668553990331e-59,
          -2.1236489660501546e-59,
          3.3667854462608947e-59,
          -1.1505640244755342e-59,
          9.304784422535334e-60,
          -1.5088616273816182e-59,
          3.2974858578823486e-59,
          1.5780755126483422e-59,
          -1.1561894322731553e-59,
          2.0522314157304795e-59,
          -2.838282752541086e-59,
          -7.174794477605174e-60,
          -1.953470472272616e-59,
          1.2519071710997301e-59,
          -2.884542843714369e-59,
          -6.851658050005497e-60,
          -1.5397530637299593e-59,
          4.101753856312112e-61,
          -1.0127152389269775e-59,
          1.415898265886761e-59,
          -3.5291263567963787e-59,
          8.997050751455441e-60,
          -1.8827493017769608e-59,
          -1.5982240352536277e-59,
          2.117255073553986e-59,
          3.36214437108831e-59,
          -1.249920227664849e-59,
          2.3225059904868294e-59,
          -2.872035256396255e-59,
          8.996683024245231e-60,
          1.744736041455693e-59,
          -2.4572463564757364e-59,
          -4.881723421586646e-60,
          2.8453320236091995e-59,
          -2.8753735576079772e-59,
          -3.5840245229591107e-59,
          6.005355808508595e-60,
          -4.2411300499321587e-60,
          2.1052411343292177e-59,
          3.095891347609291e-59,
          -1.3754756887622137e-59,
          -7.44422678684138e-60,
          -8.896772093294496e-61,
          5.839805298240545e-60,
          3.6005828120449297e-59,
          1.3499982743285937e-59,
          -7.365402439142204e-60,
          -1.6347427867652985e-59,
          3.270888164593241e-59,
          -2.6188182192910385e-59,
          1.5171122267049147e-59,
          3.1118387499721327e-59,
          1.1157471276963636e-59,
          -5.080620560353927e-60,
          -2.1230378526148857e-59,
          -8.895029083688932e-60,
          1.419254755064088e-59,
          1.0087135612627948e-59,
          3.133088606320203e-59,
          2.637994621342896e-59,
          2.2397704763394056e-59,
          2.9975619838709756e-59,
          -1.5420497238331258e-59,
          -8.752268413646718e-60,
          -8.032043324518925e-60,
          3.9720972188607004e-60,
          1.1410124293623903e-59,
          -1.466004320094862e-59,
          -3.572435929508469e-59,
          -6.701162768642369e-60,
          -1.3076636808042948e-59,
          3.2506062440149775e-59,
          2.8094855801904917e-59,
          2.5859201865889033e-59,
          1.0331452646742794e-59,
          -1.0522920856008508e-59,
          3.198823205284115e-60,
          2.232605343911217e-59,
          -2.915651795825135e-59,
          2.1235431388446765e-59,
          -3.3893686438644497e-59,
          2.2418631733354883e-59,
          2.1734489207526904e-59,
          -3.3072406836856898e-59,
          8.521518784610263e-60,
          1.5844990240163094e-61,
          -2.348818736927551e-59,
          -2.517130121240854e-59,
          1.9116667303347436e-59,
          4.457482719297283e-60,
          3.5933237575422086e-59,
          3.5869451615649827e-59,
          3.675632369170077e-59,
          -2.7541357798017512e-59,
          3.2180213248298004e-59,
          -1.7776008017073685e-59,
          -2.7307107211566705e-60,
          1.792394367105629e-59,
          -2.087541344255267e-59,
          4.364756889403635e-60,
          -2.2245462032061954e-59,
          -2.866004005650197e-59,
          -2.770660172133743e-59,
          -9.58297465182563e-60,
          -3.698510279692491e-59,
          -4.959169452770493e-60,
          1.1124192779097186e-59,
          -6.532448543959031e-60,
          -3.02006653001966e-59,
          -3.2101937021534854e-59,
          -1.5289813463842514e-59,
          -2.3527740624858456e-59,
          3.4420385635431886e-59,
          -2.4946308225029865e-59,
          2.157267565363568e-59,
          5.700990014982889e-60,
          4.5646036283282404e-60,
          7.825449074970196e-61,
          3.498208992190584e-59,
          -9.148493337382085e-60,
          2.0228945339768324e-59,
          3.627748992274463e-60,
          -6.947140702705972e-60,
          3.361287356953412e-59,
          6.532732589596811e-60,
          -2.751715841030426e-59,
          -5.453651329114305e-60,
          1.9747134219507973e-59,
          1.3240870992060648e-59,
          3.0375325394805725e-59,
          -1.6672751728599815e-59,
          1.7982916577763732e-59,
          -2.620754745206503e-60,
          4.855579710782584e-60,
          3.357781097469142e-59,
          3.56182958502248e-59,
          2.596083548756917e-59,
          -9.480752437031028e-60,
          2.804938950919424e-59,
          9.320115543339265e-60,
          -4.612768111234131e-60,
          -3.4349968586112336e-59,
          1.888024806845388e-59,
          1.3599050164451096e-61,
          2.0097387703271916e-59,
          1.7222946653518158e-59,
          2.066030095047563e-59,
          -1.3646185642708848e-59,
          2.121422317793859e-59,
          3.198627978492376e-60,
          -1.7352956116678525e-60,
          1.1902854828895678e-59,
          -3.5563648250674063e-59,
          -2.8855917251829768e-59,
          -1.4261769170705304e-59,
          3.593247125266336e-59,
          -2.5854721759421885e-59,
          -1.1494545994436872e-59,
          -3.3068593402670187e-59,
          -1.1446642056149293e-59,
          -1.2228320279152041e-59,
          3.2890365890325585e-59,
          2.4661511037678385e-59,
          -7.833461324945031e-60,
          -3.5275025929049614e-59,
          2.3554578598828924e-59,
          1.0864447708838175e-59,
          -2.4856904131678686e-59,
          3.704718722891401e-59,
          -2.902480776192837e-59,
          2.640014784910035e-59,
          -1.4109750591952652e-59,
          -4.253068357287688e-60,
          2.080479581722444e-59,
          1.2073249613764773e-59,
          3.2147757806590485e-59,
          8.103677093549354e-60,
          -2.9221497420814446e-59,
          2.7780489667356e-59,
          1.8806892986759521e-59,
          1.4556877096481267e-59,
          -3.2845360968369616e-59,
          -6.90672899804651e-60,
          -2.367431524041985e-59,
          2.2843841222909925e-59,
          1.3731713198414753e-59,
          2.7677362480062474e-59,
          3.454489127815285e-59,
          1.9229208369992886e-59,
          3.689006424421775e-59,
          7.663122450635932e-60,
          -3.4233448888339143e-59,
          -3.6166865043493103e-59,
          -1.0677473322159787e-59,
          2.29656687949561e-59,
          2.6322119070270785e-59,
          3.4060724050467796e-59,
          -3.1900626350414726e-59,
          -3.3609775183942305e-59,
          3.012531558499858e-59,
          -1.332804061841081e-59,
          3.8074766923355344e-60,
          3.588618222718777e-59,
          -6.617237272262382e-60,
          1.1243167107652696e-59,
          -6.587749136640322e-60,
          1.8734462813040917e-59,
          1.803568642971952e-60,
          -1.8304264111302286e-59,
          -1.5790715600382966e-59,
          -1.677058729444247e-59,
          2.1061462859894142e-60,
          1.39247884079164e-59,
          3.309634589570717e-59,
          1.3265459843332072e-59,
          1.9717608935619884e-59,
          -2.3557917670518054e-59,
          -8.436495951019509e-60,
          -5.708582875684895e-60,
          1.2709825480298806e-59,
          -1.3991552582435794e-59,
          -1.3454953903718945e-59,
          -9.705770023590796e-60,
          2.1945634019496566e-59,
          5.124152390623663e-60,
          -3.106308800337035e-59,
          -3.0819136961954473e-59,
          -8.62949450913684e-60,
          1.8613669076234866e-59,
          1.2875614169660553e-59,
          1.4273400714009307e-59,
          1.8660284034944388e-59,
          -1.4628195862671555e-59,
          3.159439308716133e-60,
          2.834281695165472e-60,
          1.65993128696659e-59,
          3.373040382734312e-59,
          -1.5299104783589865e-59,
          2.0638462523089153e-59,
          1.0824364736805975e-59,
          5.303156282297842e-60,
          1.9239205635002734e-59,
          3.265956413274886e-59,
          -3.427025272417836e-59,
          -2.5248622887775934e-59,
          1.7840130762769627e-59,
          -3.036454638191117e-59,
          1.0456829142622928e-60,
          -1.963764723843082e-59,
          -1.5570592983671108e-59,
          1.38268834006146e-59,
          -3.4817121399661014e-59,
          2.689525964899062e-59,
          -3.642881942828422e-60,
          1.5458581329238921e-61,
          2.615677323214718e-60,
          9.806452633550205e-60,
          -1.0482822259160972e-59,
          -2.8953928327323346e-59,
          -1.2367942901915892e-59,
          -2.361913866050693e-59,
          3.683711217074917e-60,
          -1.2393075931627355e-59,
          3.383059930296114e-59,
          3.447415017934854e-59,
          8.033413245039451e-60,
          7.851538566840027e-60,
          3.613541043205335e-59,
          2.8015739677879764e-59,
          1.8499191764620204e-59,
          -1.2711922984375088e-59,
          -9.030144058595496e-60,
          -2.1055783576414874e-59,
          -8.326873416867909e-61,
          3.6560246296842837e-59,
          3.003278394894201e-59,
          -2.7562723372855957e-59,
          -3.523941419917491e-59,
          2.8933269004800113e-59,
          2.4256534916359906e-60,
          -2.113837075495815e-59,
          1.1797646116911637e-59,
          9.713657035230042e-60,
          -2.7263011435948284e-59,
          -1.6656218931517922e-59,
          -3.2318302246672574e-59,
          -2.039850966160656e-59,
          -2.6446338703538104e-59,
          -2.16728560941728e-59,
          1.2644160334760564e-59,
          -3.319810551608095e-59,
          -2.889336905542e-59,
          -2.62975729865926e-59,
          -1.2499855000508442e-59,
          -1.3784014851283788e-59,
          -1.6993182042540813e-59,
          1.7410374530132679e-59,
          3.7214169765824206e-59,
          2.2152471239649124e-60,
